In [1]:
import numpy as np 
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import math
import acquire_plays_data
import prep_plays
import wrangle_plays_data
import re
plt.rc("figure", figsize=(12, 7))
plt.rc("font", size=14)

Acquire.py Loaded Successfully
Prep.py Loaded Successfully
Wrangle.py Loaded Successfully

In [2]:
df = pd.read_csv('players.csv')

In [3]:
df.head()

,nflId,height,weight,birthDate,collegeName,position,displayName
0,2539334,72,190,1990-09-10,Washington,CB,Desmond Trufant
1,2539653,70,186,1988-11-01,Southeastern Louisiana,CB,Robert Alford
2,2543850,69,186,1991-12-18,Purdue,SS,Ricardo Allen
3,2555162,73,227,1994-11-04,Louisiana State,MLB,Deion Jones
4,2555255,75,232,1993-07-01,Minnesota,OLB,De'Vondre Campbell

In [4]:
df.describe()

              nflId       weight
count  1.303000e+03  1303.000000
mean   2.416518e+06   222.537222
std    5.333335e+05    29.476747
min    2.520000e+02   159.000000
25%    2.539662e+06   200.000000
50%    2.553658e+06   216.000000
75%    2.558184e+06   242.000000
max    2.561671e+06   352.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1303 entries, 0 to 1302
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   nflId        1303 non-null   int64
 1   height       1303 non-null   object
 2   weight       1303 non-null   int64
 3   birthDate    1303 non-null   object
 4   collegeName  1303 non-null   object
 5   position     1303 non-null   object
 6   displayName  1303 non-null   object
dtypes: int64(2), object(5)
memory usage: 71.4+ KB

In [6]:
df.height.value_counts()

73      159
72      153
74      141
75      136
71      127
76       90
70       81
77       67
6-2      42
69       37
78       37
6-0      33
5-10     32
6-1      29
5-11     27
6-4      25
6-3      25
68       18
6-5      11
5-9       9
79        9
67        3
80        3
6-7       2
66        2
6-6       2
5-8       1
5-6       1
5-7       1
Name: height, dtype: int64

In [20]:
example = '5-10'

In [23]:
feet = int(re.findall(r'(\d+)-(\d+)', example)[0][0])
feet

5

In [22]:
inches = int(re.findall(r'(\d+)-(\d+)', example)[0][1])
inches

10

### Converts the heights from feet-inches into inches

In [10]:
def conv_height(value):
    if len(re.findall(r'(\d+)-(\d+)', value)) > 0:
        feet = int(re.findall(r'(\d+)-(\d+)', value)[0][0])
        inches = int(re.findall(r'(\d+)-(\d+)', value)[0][1])
        return (feet * 12) + inches
    else:
        return value

In [11]:
df['height'] = df.height.apply(conv_height)

In [15]:
df.head()

,nflId,height,weight,birthDate,collegeName,position,displayName
0,2539334,72,190,1990-09-10,Washington,CB,Desmond Trufant
1,2539653,70,186,1988-11-01,Southeastern Louisiana,CB,Robert Alford
2,2543850,69,186,1991-12-18,Purdue,SS,Ricardo Allen
3,2555162,73,227,1994-11-04,Louisiana State,MLB,Deion Jones
4,2555255,75,232,1993-07-01,Minnesota,OLB,De'Vondre Campbell

In [25]:
df.birthDate.value_counts()

1989-04-26    4
1994-03-09    3
1995-03-21    3
1993-01-22    3
1994-08-03    3
             ..
1990-08-13    1
1993-07-04    1
1997-02-10    1
1989-08-03    1
02/07/1991    1
Name: birthDate, Length: 1150, dtype: int64

### Converting birthdate to datetime

In [26]:
df.birthDate = pd.to_datetime(df.birthDate)

In [28]:
# Creating a age column that takes the first date and subtracts the birthdate as a
df['age'] = (pd.to_datetime('09/06/2018') - df.birthDate).astype('<m8[Y]')

In [29]:
df.head()

,nflId,height,weight,birthDate,collegeName,position,displayName,age
0,2539334,72,190,1990-09-10,Washington,CB,Desmond Trufant,27.0
1,2539653,70,186,1988-11-01,Southeastern Louisiana,CB,Robert Alford,29.0
2,2543850,69,186,1991-12-18,Purdue,SS,Ricardo Allen,26.0
3,2555162,73,227,1994-11-04,Louisiana State,MLB,Deion Jones,23.0
4,2555255,75,232,1993-07-01,Minnesota,OLB,De'Vondre Campbell,25.0

In [35]:
def prep_players():
    '''
    This function acquires the players csv and prepares
    it to merge with other csv's
    '''
    # Acquire the players csv
    df= pd.read_csv('players.csv')
    # Convert the birthdate to datetime to get rid of different date formats
    df.birthDate = pd.to_datetime(df.birthDate)
    # Creating a age column that takes the start date of the 2018 season and subtracts the birthdate
    df['age'] = (pd.to_datetime('09/06/2018') - df.birthDate).astype('<m8[Y]')
    # Function that converts heights
    def conv_height(value):
        if len(re.findall(r'(\d+)-(\d+)', value)) > 0:
            feet = int(re.findall(r'(\d+)-(\d+)', value)[0][0])
            inches = int(re.findall(r'(\d+)-(\d+)', value)[0][1])
            return (feet * 12) + inches
        else:
            return value
    # Changing height column to equal just inches
    df['height'] = df.height.apply(conv_height)
    return df

In [36]:
df= prep_players()

In [37]:
df.head()

,nflId,height,weight,birthDate,collegeName,position,displayName,age
0,2539334,72,190,1990-09-10,Washington,CB,Desmond Trufant,27.0
1,2539653,70,186,1988-11-01,Southeastern Louisiana,CB,Robert Alford,29.0
2,2543850,69,186,1991-12-18,Purdue,SS,Ricardo Allen,26.0
3,2555162,73,227,1994-11-04,Louisiana State,MLB,Deion Jones,23.0
4,2555255,75,232,1993-07-01,Minnesota,OLB,De'Vondre Campbell,25.0

In [38]:
import prep_season

In [39]:
df = prep_season.prep_players()

In [40]:
df.head()

,nflId,height,weight,birthDate,collegeName,position,displayName,age
0,2539334,72,190,1990-09-10,Washington,CB,Desmond Trufant,27.0
1,2539653,70,186,1988-11-01,Southeastern Louisiana,CB,Robert Alford,29.0
2,2543850,69,186,1991-12-18,Purdue,SS,Ricardo Allen,26.0
3,2555162,73,227,1994-11-04,Louisiana State,MLB,Deion Jones,23.0
4,2555255,75,232,1993-07-01,Minnesota,OLB,De'Vondre Campbell,25.0